<a href="https://colab.research.google.com/github/Aparna-981/ict-project/blob/main/Case_Study_SQL_Questions.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Case Study on SQL

In [9]:
import sqlite3
import pandas as pd

In [ ]:
def load_imdb_database(db_path):
  try:
    conn = sqlite3.connect(db_path)
    print("IMDB database loaded successfully.")
    return conn
  except sqlite3.Error as e:
    print(f"Error loading IMDB database: {e}")
    return None

In [21]:
db_path = "imdb.db"
conn = load_imdb_database(db_path)

if conn:
  print("Connection successful")
  cursor = conn.cursor()

IMDB database loaded successfully.
Connection successful

## Following is the schema of the IMDB database. It lists all tables and their schemas.

In [22]:
cursor.execute("SELECT name FROM sqlite_master WHERE type='table';")
tables = cursor.fetchall()

print("Database Schema:")
for table in tables:
    table_name = table[0]
    print(f"\nTable: {table_name}")

    cursor.execute(f"PRAGMA table_info({table_name});")
    schema = cursor.fetchall()

    print("Columns:")
    for column in schema:
        cid, name, dtype, notnull, dflt_value, pk = column
        print(f"  - {name} ({dtype}), NOT NULL: {bool(notnull)}, Default: {dflt_value}, Primary Key: {bool(pk)}")

Database Schema:

Table: Movie
Columns:
  - index (INTEGER), NOT NULL: False, Default: None, Primary Key: False
  - MID (TEXT), NOT NULL: False, Default: None, Primary Key: False
  - title (TEXT), NOT NULL: False, Default: None, Primary Key: False
  - year (TEXT), NOT NULL: False, Default: None, Primary Key: False
  - rating (REAL), NOT NULL: False, Default: None, Primary Key: False
  - num_votes (INTEGER), NOT NULL: False, Default: None, Primary Key: False

Table: Genre
Columns:
  - index (INTEGER), NOT NULL: False, Default: None, Primary Key: False
  - Name (TEXT), NOT NULL: False, Default: None, Primary Key: False
  - GID (INTEGER), NOT NULL: False, Default: None, Primary Key: False

Table: Language
Columns:
  - index (INTEGER), NOT NULL: False, Default: None, Primary Key: False
  - Name (TEXT), NOT NULL: False, Default: None, Primary Key: False
  - LAID (INTEGER), NOT NULL: False, Default: None, Primary Key: False

Table: Country
Columns:
  - index (INTEGER), NOT NULL: False, Default: None, Primary Key: False
  - Name (TEXT), NOT NULL: False, Default: None, Primary Key: False
  - CID (INTEGER), NOT NULL: False, Default: None, Primary Key: False

Table: Location
Columns:
  - index (INTEGER), NOT NULL: False, Default: None, Primary Key: False
  - Name (TEXT), NOT NULL: False, Default: None, Primary Key: False
  - LID (INTEGER), NOT NULL: False, Default: None, Primary Key: False

Table: M_Location
Columns:
  - index (INTEGER), NOT NULL: False, Default: None, Primary Key: False
  - MID (TEXT), NOT NULL: False, Default: None, Primary Key: False
  - LID (REAL), NOT NULL: False, Default: None, Primary Key: False
  - ID (INTEGER), NOT NULL: False, Default: None, Primary Key: False

Table: M_Country
Columns:
  - index (INTEGER), NOT NULL: False, Default: None, Primary Key: False
  - MID (TEXT), NOT NULL: False, Default: None, Primary Key: False
  - CID (REAL), NOT NULL: False, Default: None, Primary Key: False
  - ID (INTEGER), NOT NULL: False, Default: None, Primary Key: False

Table: M_Language
Columns:
  - index (INTEGER), NOT NULL: False, Default: None, Primary Key: False
  - MID (TEXT), NOT NULL: False, Default: None, Primary Key: False
  - LAID (INTEGER), NOT NULL: False, Default: None, Primary Key: False
  - ID (INTEGER), NOT NULL: False, Default: None, Primary Key: False

Table: M_Genre
Columns:
  - index (INTEGER), NOT NULL: False, Default: None, Primary Key: False
  - MID (TEXT), NOT NULL: False, Default: None, Primary Key: False
  - GID (INTEGER), NOT NULL: False, Default: None, Primary Key: False
  - ID (INTEGER), NOT NULL: False, Default: None, Primary Key: False

Table: Person
Columns:
  - index (INTEGER), NOT NULL: False, Default: None, Primary Key: False
  - PID (TEXT), NOT NULL: False, Default: None, Primary Key: False
  - Name (TEXT), NOT NULL: False, Default: None, Primary Key: False
  - Gender (TEXT), NOT NULL: False, Default: None, Primary Key: False

Table: M_Producer
Columns:
  - index (INTEGER), NOT NULL: False, Default: None, Primary Key: False
  - MID (TEXT), NOT NULL: False, Default: None, Primary Key: False
  - PID (TEXT), NOT NULL: False, Default: None, Primary Key: False
  - ID (INTEGER), NOT NULL: False, Default: None, Primary Key: False

Table: M_Director
Columns:
  - index (INTEGER), NOT NULL: False, Default: None, Primary Key: False
  - MID (TEXT), NOT NULL: False, Default: None, Primary Key: False
  - PID (TEXT), NOT NULL: False, Default: None, Primary Key: False
  - ID (INTEGER), NOT NULL: False, Default: None, Primary Key: False

Table: M_Cast
Columns:
  - index (INTEGER), NOT NULL: False, Default: None, Primary Key: False
  - MID (TEXT), NOT NULL: False, Default: None, Primary Key: False
  - PID (TEXT), NOT NULL: False, Default: None, Primary Key: False
  - ID (INTEGER), NOT NULL: False, Default: None, Primary Key: False

# Write SQL queries for the following questions

## 1. Write query to list first 5 rows of Person table

In [23]:

q1 = """select * from person  limit 5"""
cursor.execute(q1)
rows=cursor.fetchall()
for row in rows:
  print(row)

(0, 'nm0000288', ' Christian Bale', 'Male')
(1, 'nm0000949', ' Cate Blanchett', 'Female')
(2, 'nm1212722', ' Benedict Cumberbatch', 'Male')
(3, 'nm0365140', ' Naomie Harris', 'Female')
(4, 'nm0785227', ' Andy Serkis', 'Male')

In [24]:
def q1_grader(q1):
  result = pd.read_sql_query(q1, conn)
  return result.shape == (5, 4)
print(q1_grader(q1))

True

## 2. Write query to select title, year and rating from Movie table

In [25]:
q2 = """SELECT TITLE , YEAR , RATING FROM MOVIE"""

In [26]:
def q2_grader(q2):
  result = pd.read_sql_query(q2, conn)
  return result.shape == (3473, 3) and result['title'][0]=='Mowgli'
print(q2_grader(q2))

True

## 3. Write query to get title of first movie in movie table sorted by year in ascending order

In [27]:
q3 = """SELECT TITLE FROM MOVIE ORDER BY  YEAR ASC LIMIT 1"""
cursor.execute(q3)
rows=cursor.fetchall()
for row in rows:
  print(row)

('Alam Ara',)

In [28]:
def q3_grader(q3):
  result = pd.read_sql_query(q3, conn)
  return result['title']=='Alam Ara'
print(q3_grader(q3))

0    True
Name: title, dtype: bool

## 4. Write query to get the very first year in which Devdas movie was released

In [29]:
q4 = "SELECT year FROM movie WHERE title = 'Devdas' ORDER BY year ASC LIMIT 1;"
cursor.execute(q4)
rows=cursor.fetchall()
for row in rows:
  print(row)

('1936',)

In [30]:
def q4_grader(q4):
  result = pd.read_sql_query(q4, conn)
  return result['year']=='1936'
print(q4_grader(q4))

0    True
Name: year, dtype: bool

## 5. Write query to get the number of movies released in 2018

In [31]:
q5 = """ SELECT COUNT(TITLE) FROM MOVIE WHERE YEAR=2018"""
cursor.execute(q5)
rows=cursor.fetchall()
for row in rows:
  print(row)

(93,)

In [32]:
def q5_grader(q5):
  result = pd.read_sql_query(q5, conn)
  return result.iloc[0, 0] == 93
print(q5_grader(q5))

True

## 6. Write query to get the title of the movie with most number of votes in 2012

In [33]:
q6 = """SELECT TITLE FROM MOVIE WHERE YEAR=2012 ORDER BY NUM_VOTES DESC LIMIT 1 """
cursor.execute(q6)
rows=cursor.fetchall()
for row in rows:
  print(row)

('The Avengers',)

In [34]:
def q6_grader(q6):
  result = pd.read_sql_query(q6, conn)
  return result["title"]=="The Avengers"
print(q6_grader(q6))

0    True
Name: title, dtype: bool

## 7. Write SQL query to find all the unique movie titles released in 2018

In [35]:
q7 = """SELECT DISTINCT TITLE  FROM MOVIE WHERE YEAR = 2018"""
cursor.execute(q7)
rows=cursor.fetchall()
for row in rows:
  print(row)

('Mowgli',)
("Ocean's Eight",)
('Tomb Raider',)
('Tumbbad',)
('Kedarnath',)
('Andhadhun',)
('Rajma Chawal',)
('Manto',)
('Stree',)
('Thugs of Hindostan',)
('Badhaai Ho',)
('Hotel Mumbai',)
('Jalebi',)
('Manmarziyaan',)
('Pataakha',)
('Sanju',)
('Karwaan',)
('Mitron',)
('Padman',)
('Padmaavat',)
('Raazi',)
('Lust Stories',)
('Love Sonia',)
('Batti Gul Meter Chalu',)
('Loveyatri',)
('Love Per Square Foot',)
('Sui Dhaaga: Made in India',)
('FryDay',)
('Bhavesh Joshi Superhero',)
('Sonu Ke Titu Ki Sweety',)
('Satyameva Jayate',)
('Race 3',)
('Parmanu: The Story of Pokhran',)
('Dhadak',)
('Happy Phirr Bhag Jayegi',)
('Laila Majnu',)
('Aiyaary',)
('Baazaar',)
('Raid',)
('Soorma',)
('Veere Di Wedding',)
('Dil Juunglee',)
('Halkaa',)
('Welcome to New York',)
('Hichki',)
('Kaalakaandi',)
('102 Not Out',)
('Baaghi 2',)
('Namaste England',)
('Nanu Ki Jaanu',)
('Mard Ko Dard Nahin Hota',)
('Hate Story IV',)
('Bhaiaji Superhit',)
('Paltan',)
('Yamla Pagla Deewana Phir Se...',)
('Phamous',)
('Nawabzaade',)
('Once Again',)
('Kuchh Bheege Alfaaz',)
('Angrezi Mein Kehte Hain',)
('Bioscopewala',)
('3 Storeys',)
('Saheb Biwi Aur Gangster 3',)
('Teri Bhabhi Hai Pagle',)
('Vishwaroopam 2',)
('Helicopter Eela',)
('Vodka Diaries',)
('High Jack',)
('Lupt',)
('Hope Aur Hum',)
('Silvat',)
('Daas Dev',)
('1921',)
('Kaashi in Search of Ganga',)
('Meri Nimmo',)
('Veerey Ki Wedding',)
('Khajoor Pe Atke',)
('Teen Aur Aadha',)
('The Dark Side of Life: Mumbai City',)
('Baarish Aur Chowmein',)
('Soni',)
('Subedar Joginder Singh',)
('Hey Ram Hamne Gandhi Ko maar Diya',)
('Phir Se...',)
('My Birthday Song',)
('T for Taj Mahal',)
('Nirdosh',)
('Haseena',)
('Leera the Soulmate',)
('Shaadi Teri Bajayenge Hum Band',)
('Aadamkhor',)
("Vaibhav Sethia: Don't",)
('Shohrat the Trap',)

In [36]:
def q7_grader(q7):
  result = pd.read_sql_query(q7, conn)
  return result.shape==(93, 1)
print(q7_grader(q7))

True

## 8. Write SQL query to get total number of movies released between 2017 (inclusive) and 2018 (inclusive)

In [37]:
q8 = """SELECT COUNT(TITLE) FROM MOVIE WHERE  YEAR >= 2017 AND YEAR <=2018 """
cursor.execute(q8)
rows=cursor.fetchall()
for row in rows:
  print(row)

(211,)

In [38]:
def q8_grader(q8):
  result = pd.read_sql_query(q8, conn)
  return result.iloc[0, 0] == 211
print(q8_grader(q8))

True

## 9. Write SQL query to find the year in which maximum number of movies released

In [39]:
q9 = """SELECT YEAR FROM MOVIE GROUP BY YEAR ORDER BY COUNT(*) DESC LIMIT 1"""
cursor.execute(q9)
rows=cursor.fetchall()
for row in rows:
  print(row)

('2005',)

In [40]:
def q9_grader(q9):
  result = pd.read_sql_query(q9, conn)
  return result["year"][0]=="2005"
print(q9_grader(q9))

True

## 10. Write SQL query to find the title of the movie with rating>9.5 and number of votes > 90

In [41]:
q10 = """SELECT title FROM movie WHERE rating>9.5 and num_votes>90;"""
cursor.execute(q10)
rows = cursor.fetchall()
for row in rows:
    print(row)

('Man on Mission Fauladi',)

In [42]:
def q10_grader(q10):
  result = pd.read_sql_query(q10, conn)
  return result["title"][0]=="Man on Mission Fauladi"
print(q10_grader(q10))

True

## 11. Write SQL query to find the number of movies which has the word 'Dilwale' in their title

In [43]:
q11 = """select count(title) from movie where Title like '%dilwale%'"""
cursor.execute(q11)
rows = cursor.fetchall()
for row in rows:
    print(row)

(4,)

In [44]:
def q11_grader(q11):
  result = pd.read_sql_query(q11, conn)
  return result.iloc[0, 0] == 4
print(q11_grader(q11))

True

## 12. Write nested SQL query to find the CID of country which produced most number of movies

In [45]:
q12 = """SELECT CID
FROM M_Country
GROUP BY CID
HAVING COUNT(MID) = (
    SELECT MAX(movie_count)
    FROM (
        SELECT CID, COUNT(MID) AS movie_count
        FROM M_Country
        GROUP BY CID
    ) AS sub
);
 """
cursor.execute(q12)
rows = cursor.fetchall()
for row in rows:
    print(row)

(2.0,)

In [46]:
def q12_grader(q12):
  result = pd.read_sql_query(q12, conn)
  return result.iloc[0]==2.0
print(q12_grader(q12))

CID    True
Name: 0, dtype: bool

## 13. Write nested SQL query to the country which produced most number of movies (use both Courty table and M_Country table)

In [47]:
q13 = """SELECT NAME FROM COUNTRY WHERE
 CID = (SELECT CID FROM M_COUNTRY
  GROUP BY CID HAVING COUNT(MID)= (
    SELECT  MAX(MOVIE_COUNT) FROM (
        SELECT CID, COUNT(MID) AS movie_count
            FROM M_Country
            GROUP BY CID
        ) AS sub
        )
)"""
cursor.execute(q13)
rows = cursor.fetchall()
for row in rows:
    print(row)

('India',)

In [48]:
def q13_grader(q13):
  result = pd.read_sql_query(q13, conn)
  return result.iloc[0, 0] == "India"
print(q13_grader(q13))

True

## 14. Write SQL query to get the year and number of movies per year having number of movies per year is greater than 100

In [49]:
q14 = """SELECT year, COUNT(*) AS num_movies FROM movie GROUP BY year HAVING COUNT(*) > 100;"""
cursor.execute(q14)
rows = cursor.fetchall()
for row in rows:
    print(row)

('2003', 101)
('2004', 103)
('2005', 128)
('2007', 104)
('2008', 103)
('2010', 117)
('2011', 109)
('2012', 108)
('2013', 127)
('2014', 118)
('2015', 109)
('2016', 118)
('2017', 118)

In [50]:
def q14_grader(q14):
  result = pd.read_sql_query(q14, conn)
  return result.shape==(13,2)
print(q14_grader(q14))

True

## 15. Write SQL query to get the Name and Language ID (LAID) corresponding to Malayalam language

In [51]:
q15 = """select Name , LAID FROM Language WHERE NAME = 'Malayalam' """
cursor.execute(q15)
rows = cursor.fetchall()
for row in rows:
    print(row)

('Malayalam', 19)

In [52]:
def q15_grader(q15):
  result = pd.read_sql_query(q15, conn)
  print(result)
  return result[["Name", "LAID"]].values.tolist() == [['Malayalam', 19]]
print(q15_grader(q15))

        Name  LAID
0  Malayalam    19
True

## 16. Write SQL query to do inner join with movie table and M_Language table with MID colums

In [57]:
q16 = """select m.mid,LAID,ID FROM MOVIE M INNER JOIN M_LANGUAGE ML ON M.MID = ML.MID """

In [58]:
def q16_grader(q16):
  result = pd.read_sql_query(q16, conn)
  return result
print(q16_grader(q16))

            MID  LAID    ID
0     tt2388771     0     0
1     tt5164214     0     1
2     tt1365519     0     2
3     tt0848228     0     3
4     tt8239946     1     4
...         ...   ...   ...
3468  tt0090611     2  3470
3469  tt0106270     2  3471
3470  tt0852989     2  3472
3471  tt0375882     2  3473
3472  tt0375890     2  3474

[3473 rows x 3 columns]

## 17. Write SQL query to list title, year and rating of malayalam movies in the database by doing an inner join with movie table and M_Language table with MID column, also assuming language ID of malayalam movies as 19

In [59]:
q17 = """select m.title, m.year, m.rating
from Movie m
INNER JOIN M_Language ml
    ON m.MID = ml.MID
WHERE ml.LAID = 19;
"""
cursor.execute(q17)
rows = cursor.fetchall()
for row in rows:
    print(row)

('Dil Hai Betaab', '1993', 4.6)
('Chemmeen', '1965', 7.8)
('Aryan', '1988', 7.2)
('Kala Pani', '1996', 8.4)
('Aadupuliyattam', '2016', 4.2)
('New Delhi', '1987', 7.7)
('Who', 'I 2018', 7.1)
('Cover Story', '2000', 5.8)
('Vaishali', '1988', 7.7)
('Maanthrikam', '1995', 6.3)
('Abhimanyu', '1991', 7.1)
('Inspector Balram', '1991', 6.9)
('Satyameva Jayate', '2000', 5.3)
('Veettilekkulla Vazhi', '2011', 6.8)
('Alavuddinum Athbutha Vilakkum', '1979', 6.8)
('The Train', '2011', 4.5)

In [60]:
def q17_grader(q17):
  result = pd.read_sql_query(q17, conn)
  return result.shape==(16,3)
print(q17_grader(q17))

True

In [77]:
![ -f academic.db ] && rm academic.db

conn = sqlite3.connect("academic.db")
cursor = conn.cursor()

## 18. Write SQL query to Create a table named students with two columns id (integer type) and name (varchar type)

In [78]:
q18a = """CREATE TABLE Students (
    id INTEGER PRIMARY KEY,
    name VARCHAR(200)
);"""

In [79]:
def q18_grader_a(q18):
  try:
    cursor.execute(q18)
    return True
  except:
    pass

def q18_grader_b(q19):
  result = pd.read_sql_query(q19, conn)
  return result.columns.tolist() == ['id', 'name']

q18b = """SELECT * FROM students;"""

print(q18_grader_a(q18a) and q18_grader_b(q18b))

True

## 19. Write SQL query to insert the values (1, 'Alice') into students table

In [83]:
q19_a = """INSERT INTO Students VALUES (1,'Alice')"""
cursor.execute("select * from students")
rows = cursor.fetchall()
for row in rows:
    print(row)

(1, 'Alice')

In [84]:
def q19_grader_a(q19_a):
  try:
    cursor.execute(q19_a)
  except:
    pass
  return True

def q19_grader_b(q19_b):
  result = pd.read_sql_query(q19_b, conn)
  return result.values.tolist() == [[1, 'Alice']]

q19_b = "SELECT * FROM students"
print(q19_grader_a(q19_a) and q19_grader_b(q19_b))

True

## 20. Write SQL Query to add the following more information to students table

| ID | Name    |
|----|---------|
| 2  | Bob     |
| 3  | Charlie |

In [92]:
q20 = """INSERT INTO STUDENTS VALUES (2,'Bob'),
(3,'Charlie');"""
cursor.execute("select * from students")
rows = cursor.fetchall()
for row in rows:
    print(row)

(1, 'Alice')
(2, 'Bob')
(3, 'Charlie')

In [91]:
def q20_grader(q20):
  try:
    cursor.execute(q20)
  except:
    pass
  return True

def q20_grader_b(q20_b):
  result = pd.read_sql_query(q20_b, conn)
  return result.values.tolist() == [[1, 'Alice'], [2, 'Bob'], [3, 'Charlie']]

print(q20_grader(q20) and q20_grader_b(q19_b))

True

In [ ]:
# conn.close()